Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་བཞིན་གཤེགས་པས་འཁོར་འདི་ལས་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྣམས་ནི་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དང་། འཁོར་བས་སྐྲག་པའི་སེམས་ཅན་རྣམས་ནི་སློབ་པ་ཡང་མ་ལགས་མི་སློབ་པ་ཡང་མ་ལགས་པར་འགྱུར་བ་དང་། སློབ་པ་དང་མི་སློབ་པར་འགྱུར་བ་དང་། འཁོར་བ་ལ་མངོན་དུ་ཕྱོགས་པའི་སེམས་ཅན་རྣམས་ནི་ཡིད་འབྱུང་བར་འགྱུར་བ་དང་། ཀླུ་དང་གནོད་སྦྱིན་གྱི་འཁོར་འདི་ནི་འགྲོ་བ་དམན་པ་དང་བྲལ་ཞིང་རྒྱ་ཆེན་པོའི་འགྲོ་བར་འགྱུར་བ་དང་། ཟབ་མོ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་པ་དང་བསམ་པ་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་བཞུགས་ཀྱང་རུང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། བདག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བར་བགྱི་བའི་སླད་དུ་ཆོས་བསྟན་དུ་གསོལ།
en: The nāga king Anavatapta then said to the Blessed One, “Thus-Gone One, please teach us the Dharma so that the beings gathered here who have not yet generated the mind intent on awakening may generate it; so that those who have already generated the mind of awakening may reach irreversibility; so that those who fear saṃsāra and who follow neither the path of training nor the path of no more training may follow the path of training and the path of no more training; so that those who are inclined toward saṃsāra may become averse to it; so that this congregation of nāgas and yakṣas may become free from inferior rebirths and instead reach exalted rebirths; so that bodhisattvas who are inclined toward the profound may develop pure minds and thoughts; and so that I may uphold the sacred Dharma, both while the Thus-Gone One is living and after he has passed into parinirvāṇa!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said to the nāga king Anavatapta, “Lord of nāgas, listen carefully and pay attention.

source: ཀླུའི་བདག་པོ་དེའི་ཕྱིར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: I shall tell you.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Yes, Blessed One, I will,” he replied, and the nāga king Anavatapta listened as the Blessed One had instructed.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་དང་ལྡན་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མངོན་པར་འདུ་བར་འགྱུར་རོ། །
en: The Blessed One continued, “Lord of nāgas, when bodhisattvas have a single quality, they enthrall the entire world with its gods.

source: ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: What is that quality?

source: འདི་ལྟ་སྟེ། ཟབ་མོའི་ཆོས་ལ་རབ་ཏུ་སྦྱོར་བའི་བག་ཡོད་པའོ། །
en: It is heedfulness that holds fast to the profound Dharma.

source: དེ་ལ་ཟབ་མོའི་ཆོས་ལ་རབ་ཏུ་སྦྱོར་བའི་བག་ཡོད་པ་གང་ཞེ་ན།
en: What is this heedfulness that holds fast to the profound Dharma?

source: ཀླུའི་བདག་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་ཅིང་མཐར་ལྟ་བ་གཉི་ག་དང་བྲལ་ལ། ཡོད་པ་དང་མེད་པར་ཁས་མི་ལེན་པས་ཆོས་ཐམས་ཅད་རྐྱེན་གྱི་ཁ་ན་ལས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་སྟེ།
en: Lord of nāgas, it is when bodhisattva great beings engage with dependent origination and, by being without the two extreme views and asserting neither existence nor nonexistence, see that all phenomena depend on conditions.

source: གང་རྒྱུ་མེད་པ་ལས་བྱུང་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཆོས་གང་རྒྱུའི་ཁ་ན་ལས་པ་དེ་ནི་རྐྱེན་གྱི་ཁ་ན་ལས་པའོ། །གང་རྐྱེན་གྱི་ཁ་ན་ལས་པ་དེ་ནི་མ་སྐྱེས་པའོ། །
en: Understanding that no phenomena can be considered as arising without causes, they think, ‘That which depends on causes also depends on conditions, and that which depends on conditions is unborn.

source: གང་མ་སྐྱེས་པ་དེ་ནི་སྟོང་པའོ། །
en: That which is unborn is empty.

source: གང་སྟོང་པ་དེ་ནི་མཚན་མ་མེད་པའོ། །
en: That which is empty is beyond signs.

source: གང་མཚན་མ་མེད་པ་དེ་ནི་སྨོན་པ་མེད་པའོ། །
en: That which is beyond signs is beyond wishes.

source: གང་སྨོན་པ་མེད་པ་དེ་ནི་ཞི་བའོ། །
en: That which is beyond wishes is peaceful.

source: གང་ཞི་བ་དེ་ནི་ཉེ་བར་ཞི་བའོ། །
en: That which is peaceful is at peace.

source: གང་ཉེ་བར་ཞི་བ་དེ་ནི་མི་གཡོ་བའོ། །
en: That which is at peace does not stir.

source: གང་མི་གཡོ་བ་དེ་ནི་རང་བཞིན་གྱིས་བེམས་པོའོ། །
en: That which does not stir is inert by nature.

source: རང་བཞིན་གྱིས་བེམས་པོ་གང་ཡིན་པ་དེ་ནི་རྐྱེན་གྱི་ཁ་ན་ལས་པའོ། །
en: That which is inert by nature depends on conditions.

source: གང་རྐྱེན་གྱི་ཁ་ན་ལས་པ་དེ་ལ་ནི་བདག་མེད།
en: That which depends on conditions is without self and without ‘mine.’

source: བདག་གི་མེད་དོ། །གང་བདག་མེད་པ་དེ་ནི་ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཚུལ་གྱིས་བརྗོད་དུ་མེད་པའོ། །
en: That which is without self is inexpressible in accordance with the absence of apprehending.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཡོད་པ་ཅན་ནི་རྟོན་པ་བཞི་ལ་རྟོན་ཏེ།
en: “Lord of nāgas, those bodhisattva great beings rely on four reliances.

source: དོན་ལ་རྟོན་གྱི་ཚིག་འབྲུ་ལ་མ་ཡིན་པ་དང་། ཡེ་ཤེས་ལ་རྟོན་གྱི་རྣམ་པར་ཤེས་པ་ལ་མ་ཡིན་པ་དང་། ངེས་པའི་དོན་ལ་རྟོན་གྱི་དྲང་བའི་དོན་ལ་མ་ཡིན་པ་དང་། ཆོས་ཉིད་ལ་རྟོན་གྱི་གང་ཟག་ལ་མ་ཡིན་ཏེ།
en: They rely on meaning rather than words; they rely on wisdom rather than consciousness; they rely on the definitive meaning rather than the provisional meaning; and they rely on the true nature rather than individuals.

source: འདི་ནི་རྟོན་པ་བཞི་ལ་རྟོན་པའོ། །
en: These are the four reliances on which they rely.

source: དེ་ལ་དོན་ནི་གང་།
en: “What is this ‘meaning’?

source: ཡེ་ཤེས་ནི་གང་།
en: What is this ‘wisdom’?

source: ངེས་པའི་དོན་ནི་གང་།
en: What is this ‘definitive meaning’?

source: ཆོས་ཉིད་ནི་གང་ཞེ་ན།
en: What is this ‘true nature’?

source: དོན་ཅེས་བྱ་བ་ལ་གང་སྟོང་པ་ཉིད་ནི་དོན་ཏེ། དོན་གང་ཡིན་པ་དེ་ལ་ལྟ་བ་རྗེས་སུ་རྒྱས་པར་མི་བྱེད་དོ། །
en: Meaning refers to emptiness, which does not elaborate views.

source: གང་མཚན་མ་མེད་པ་ནི་དོན་ཏེ། དེ་ལ་རྣམ་པར་རྟོག་པ་རྗེས་སུ་རྒྱས་པར་མི་བྱེད་དོ། །
en: The absence of signs is the meaning; it does not elaborate conceptual thinking.

source: གང་སྨོན་པ་མེད་པ་ནི་དོན་ཏེ། དེ་ལ་ཁམས་གསུམ་པ་རྗེས་སུ་རྒྱས་པར་མི་བྱེད་དེ།
en: The absence of wishes is the meaning; it does not elaborate the three realms.

source: འདི་ནི་དོན་ཅེས་བྱའོ། །
en: This is what is referred to as meaning.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་དོན་ཅེས་བྱ་བ་ནི་གང་ཆོས་དང་ཆོས་མ་ཡིན་པ་གཉིས་སུ་དབྱེར་མེད་པའོ། །
en: “Furthermore, lord of nāgas, ‘meaning’ is the absence of distinction between phenomena and non-phenomena.

source: གང་ཆོས་རྣམ་པར་གཞག་པ་བརྗོད་དུ་ཡོད་པ་སྒྲ་དང་ཚིག་གི་ལམ་གྱིས་བརྗོད་དུ་མེད་ཅིང་གནས་པ་མེད་པ་དང་། གང་ཟག་མེད་པའི་དོན་ཏེ།
en: It means that phenomena, usually presented in terms of categories, cannot be expressed by words and sounds and are baseless and without individuality—beings and persons are merely conventional designations.

source: སེམས་ཅན་དང་གང་ཟག་ཏུ་ཐ་སྙད་འདོགས་པ་འདི་ནི་དོན་ཅེས་བྱའོ། །
en: This is what is referred to as meaning.

source: གཞན་ཡང་དོན་ཅེས་བྱ་བ་ནི་གང་ཆོས་དོན་དུ་གཉེར་བ་ཡིན་གྱི་འཐོབ་པ་དོན་དུ་གཉེར་བ་མ་ཡིན་ནོ། །
en: “Furthermore, meaning refers to concern for the Dharma but not for attainment.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དོན་དུ་གཉེར་གྱི་འཐོབ་པ་དོན་དུ་གཉེར་བམ་ཡིན་ཞེ་ན།
en: How do bodhisattvas concern themselves with the Dharma but not with attainment?

source: གང་མིག་དོན་དུ་གཉེར་བ་མ་ཡིན། གཟུགས་དོན་དུ་གཉེར་བ་མ་ཡིན། རྣ་བ་དང་། སྒྲ་དང་། སྣ་དང་། དྲི་དང་། ལྕེ་དང་། རོ་དང་། ལུས་དང་། རེག་བྱ་དོན་དུ་གཉེར་བ་མ་ཡིན།
en: They do not concern themselves with the eye and its forms, with the ear and its sounds, with the nose and its smells, with the tongue and its tastes, with the body and its tactile objects, or with the mind and its mental phenomena.

source: ཡིད་དོན་དུ་གཉེར་བ་མ་ཡིན། ཆོས་དོན་དུ་གཉེར་བ་མ་ཡིན། གཟུགས་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན། ཚོར་བ་ལ་མ་ཡིན། འདུ་ཤེས་ལ་མ་ཡིན།
en: They do not concern themselves with fixation on form or with fixation on feeling, perception, formation, or consciousness.

source: འདུ་བྱེད་ལ་མ་ཡིན། རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན། འདོད་པ་དང་། གཟུགས་དང་། གཟུགས་མེད་པ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན།
en: They do not concern themselves with fixation on the desire realm, the form realm, or the formless realm.

source: བདག་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན། སེམས་ཅན་ལ་མ་ཡིན། སྲོག་ལ་མ་ཡིན། གསོ་བ་ལ་མ་ཡིན། སྐྱེས་བུ་ལ་མ་ཡིན།
en: They do not concern themselves with fixation on a self, nor with fixation on a being, a life force, a soul, a person, or an individual.

source: གང་ཟག་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན། དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན།
en: They do not concern themselves with fixation on the form body of the Thus-Gone One.

source: ཆོས་ཀྱི་ཡི་གེ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན།
en: They do not concern themselves with fixation on the words of the Dharma.

source: དགེ་འདུན་གྱི་ཚོགས་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན།
en: They do not concern themselves with fixation on the Saṅgha.

source: སྦྱིན་པ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་ལ་མ་ཡིན།
en: They do not concern themselves with fixation on generosity, nor with fixation on discipline, patience, diligence, concentration, or insight.

source: ཤེས་རབ་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན་པ་ནས་ཆོས་ཐམས་ཅད་ཀྱི་བར་ལ་མངོན་པར་ཞེན་པ་དོན་དུ་གཉེར་བ་མ་ཡིན་ཏེ།
en: They do not concern themselves with fixation on any phenomena whatsoever.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དོན་དུ་གཉེར་བ་ཞེས་བྱའོ། །
en: That is how bodhisattvas concern themselves with the Dharma.

source: གང་དོན་དེ་དག་ལ་དོན་ཅེས་ཚིག་གིས་བརྗོད་དུ་མེད་པ་འདི་ནི་དོན་ཅེས་བྱའོ། །
en: The fact that such things cannot be expressed by the word meaning is what is referred to as the meaning.

source: དེ་ལ་ཤེས་པ་གང་ཞེ་ན།
en: “What is ‘wisdom’?

source: སྡུག་བསྔལ་ལ་མི་སྐྱེ་བར་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ལ་སྒྲོ་བཏགས་པ་མེད་པར་ཤེས་པ་དང་། འགོག་པ་ལ་ཤིན་ཏུ་ཟད་པར་ཤེས་པ་དང་། ལམ་ལ་འོང་བ་དང་འགྲོ་བ་མེད་པར་ཤེས་པ་དང་།
en: It is the knowledge that suffering is unborn, the knowledge that the origin of everything is beyond imputation, the knowledge that cessation is complete exhaustion, and the knowledge that the path is beyond coming and going.

source: ཕུང་པོ་རྣམས་ལ་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་དང་། ཁམས་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པར་ཤེས་པ་དང་། སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་ལྟ་བུར་ཤེས་པ་དང་།
en: It is the knowledge that the aggregates are like illusions, the knowledge that the elements are indivisible from the realm of phenomena, and the knowledge that the sense sources are like an empty village.

source: ཆོས་རྣམས་ལ་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཤེས་པ་དང་།
en: It is the knowledge that discerns phenomena.

source: སེམས་ཅན་གྱི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཤེས་པ་དང་།
en: It is knowing which beings have supreme faculties and which do not.

source: དྲན་པ་ལ་བརྗེད་པ་མེད་པར་ཤེས་པ་དང་།
en: It is knowing that in mindfulness there can be no forgetfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པར་ཤེས་པ་དང་།
en: It is knowing that in the applications of mindfulness there is no recollection or mental engagement.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་ལ་དགེ་བ་དང་མི་དགེ་བ་རྣམས་སུ་ཡང་དག་པར་ཤེས་པ་དང་།
en: It is clearly discerning virtue and nonvirtue in the correct exertions.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ལ་ལུས་དང་སེམས་ཡང་བར་ཤེས་པ་དང་།
en: It is knowing the bases of miraculous power in terms of the lightness of body and mind.

source: དབང་པོ་རྣམས་ཀྱི་རིམ་པ་ཤེས་པ་དང་།
en: It is knowing the stages of the strengths.

source: སྟོབས་རྣམས་ལ་རྫི་བ་མེད་པར་ཤེས་པ་དང་།
en: It is knowing that the powers are indomitable.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ལ་ཆོས་ཐམས་ཅད་རྟོགས་པར་ཤེས་པ་དང་།
en: It is knowing that in the branches of awakening all phenomena are understood.

source: ལམ་ལ་འདུས་མ་བྱས་པར་ཤེས་པ་དང་།
en: It is knowing that the path is unconditioned.

source: ཞི་གནས་ལ་ཞི་བར་ཤེས་པ་དང་།
en: It is knowing that tranquility is peace.

source: ལྷག་མཐོང་ལ་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པར་ཤེས་པ་དང་།
en: It is knowing that special insight is the thorough discernment of phenomena.

source: སྔོན་གྱི་མཐའ་ལ་མ་བྱུང་བར་ཤེས་པ་དང་། ཕྱི་མའི་མཐའ་མི་འཕོ་བར་ཤེས་པ་དང་། བར་མ་ལ་མི་གནས་པར་ཤེས་པ་དང་།
en: It is knowing that there is no birth in all of the past, that there is no passing away in all of the future, and that there is no abiding between the two.

source: ལུས་ལ་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་པ་དང་། ཚིག་ལ་བྲག་ཅ་ལྟ་བུར་ཤེས་པ་དང་།
en: It is knowing that the body is like a reflection, that words are like echoes, and that the mind is like an illusion.

source: སེམས་ལ་སྒྱུ་མའི་ཆོས་ལྟ་བུར་ཤེས་པ་འདི་ནི་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is referred to as wisdom.

source: དེ་ལ་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་གང་ཞེ་ན།
en: “What are the discourses of ‘definitive meaning’?

source: གང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་འདི་བསྟན་པ་སྟེ།
en: They are the teachings on dependent origination.

source: འདི་ལྟར་མ་རིག་པ་འགགས་པ་ནས་རྒ་ཤི་འགགས་པའི་བར་ལ་བདག་མེད་པར་བསྟན་པ་དང་།
en: They teach the absence of self, from the cessation of ignorance up to the cessation of old age and death.

source: སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པར་ཡོངས་སུ་བསྟན་པ་སྟེ།
en: They teach the lack of a being, a life force, a soul, and a person.

source: ཇི་ལྟར་གཟིངས་ལྟ་བུའི་མདོ་ལས་ཆོས་ཀྱང་སྤང་བར་བྱ་ན། ཆོས་མ་ཡིན་པ་ལྟ་ཅི་སྨོས་ཞེས་གསུངས་པ་ལྟ་བུའོ། །
en: As it says in the discourses, ‘If, like a raft, even the Dharma is to be discarded, one need not speak of non-Dharma.’

source: དེ་ལ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཡོངས་སུ་སྟོན་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་དང་། བསླབ་པ་གསུམ་ལ་མི་དམིགས་པར་སློབ་པ་སྟེ།
en: Without reference points, they teach the three gateways to liberation, the sameness of the three times, and the three trainings.

source: ཇི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་འགྲོ་བ་མེད་པར་མཐོང་ནས་ཡང་དག་པ་ཉིད་མི་འགྱུར་བ་ལ་མི་འཇུག་ཅིང་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་རྣམས་དང་།
en: They regard all composite things as being beyond going, and they do not posit an immutable reality.

source: སྟོབས་རྣམས་དང་།
en: They teach that the transcendent strengths and powers and the insight of the bodhisattvas transcend conception and mental engagement.

source: བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ལ་འདུ་ཤེས་དང་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་མི་འབྱུང་བ་འདི་ནི་ངེས་པའི་དོན་གྱི་མདོ་སྡེའོ་ཞེས་གསུངས་པ་ལྟ་བུའོ། །
en: This is what is referred to as the discourses of definitive meaning.

source: དེ་ལ་ཆོས་ཉིད་གང་ཞེ་ན།
en: “What is ‘the true nature’?

source: དེ་བཞིན་གཤེགས་པ་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་། ཆོས་ཉིད་འདི་ནི་འདུག་པ་ཉིད་དེ།
en: Whether a thus-gone one has appeared or has not appeared, the true nature is still there.

source: ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་དང་། ཆོས་མི་འགྱུར་བ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །གང་དེ་བཞིན་ཉིད་དང་། ཕྱིན་ཅི་མ་ལོག་པ་དེ་བཞིན་ཉིད་དང་།
en: The realm of phenomena, the abiding nature of phenomena, the immutable nature of phenomena, and the limit of reality are known as the true nature.

source: གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། གཉིས་སུ་མེད་པ་ཉིད་དང་། ཡང་དག་པ་ཉིད་དང་། དེ་ཁོ་ན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་སྔོན་གྱི་མཐའ་མ་ཡིན་པ་དང་།
en: Thusness, unmistaken thusness, the thusness that is not other, nonduality itself, reality itself, just that, the limit of reality that is not the extent of the past, and the extent of the past that is not the limit of reality—these are known as the true nature.

source: སྔོན་གྱི་མཐའ་ཡང་དག་པའི་མཐའ་མ་ཡིན་པ་འདི་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །ཐེག་པ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལས་བྱུང་བ་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །
en: The Great Vehicle based on the six perfections is known as the true nature.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལས་བྱུང་བ་དང་།
en: The vehicle of the solitary buddhas based on dependent origination is known as the true nature.

source: སྒྲའི་རྗེས་སུ་འགྲོ་བ་ལ་མོས་པ་ལས་བྱུང་བ་ཉན་ཐོས་ཀྱི་ཐེག་པ་འདི་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །
en: The vehicle of the hearers based on dedication to following the words is known as the true nature.

source: ལོངས་སྤྱོད་ཆེན་པོའི་ཕྱིར་སྦྱིན་པ་ཡང་ཆོས་ཉིད་ཅེས་བྱའོ། །
en: Even great wealth due to generosity is known as the true nature.

source: མཐོ་རིས་སུ་སྐྱེ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་དང་། ཤེས་རབ་ཆེན་པོའི་ཕྱིར་ཐོས་པ་དང་། མ་བྲལ་བའི་ཕྱིར་སྒོམ་པ་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །
en: Even rebirth in the higher realms due to discipline, great insight due to learning, and inseparability due to meditation are known as the true nature.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པའི་རྒྱུ་ལས་བྱུང་བ་ནི་འཁོར་བའོ། །ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་རྒྱུ་ལས་བྱུང་བ་ནི་ཆོས་ཉིད་དོ། །
en: “Furthermore, lord of nāgas, that which arises from improper mental engagement is saṃsāra, while that which arises from proper mental engagement is the true nature.

source: ཉོན་མོངས་པའི་སྟོབས་ཅན་ནི་བྱིས་པའོ། །ཤེས་རབ་ཀྱི་སྟོབས་ཅན་ནི་མཁས་པ་སྟེ།
en: Those with powers of affliction are the foolish, and those with powers of insight are the wise.

source: འདི་ནི་ཆོས་ཉིད་ཅེས་བྱའོ། །ཆོས་ཉིད་ཅེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་གཞོལ་བའོ། །
en: This is what is known as the true nature; that which is known as the true nature applies to the realm of all phenomena.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྟོན་པ་དེ་ནི་རྟོན་པ་བཞི་པོ་དེ་དག་ལ་རྟོན་པའོ། །
en: “So, lord of nāgas, those who rely on dependent origination rely on the four reliances.

source: གང་རྟོན་པ་བཞི་པོ་དག་ལ་རྟོན་པ་དེ་ནི་ཆད་པ་དང་རྟག་པ་ལ་རྟོན་པ་མ་ཡིན་ཏེ།
en: Those who rely on the four reliances do not rely on nihilism or eternalism.

source: དེའི་ཕྱིར་སུས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཐོང་བ་དེས་ཆོས་མཐོང་ངོ་། །
en: Therefore, it is said, ‘Whoever sees dependent origination sees the Dharma.

source: སུས་ཆོས་མཐོང་བ་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་ཞེས་བྱའོ། །
en: Whoever sees the Dharma sees the Thus-Gone One.’

source: ཀླུའི་བདག་པོ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཞེས་བྱ་བ་ནི་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན་པའོ། །འབྲེལ་བར་འབྱུང་བ་མ་ཡིན་པ་ནི་མི་སྐྱེ་བའོ། །
en: “Lord of nāgas, that which is known as dependent origination is not originated, and that which is not originated is not born.

source: མི་སྐྱེ་བ་ནི་ཆོས་སོ། །
en: The unborn is the Dharma.

source: ཆོས་ནི་འདོད་ཆགས་དང་བྲལ་བའོ། །
en: The Dharma is free of attachment.

source: འདོད་ཆགས་དང་བྲལ་བ་ནི་དེ་བཞིན་གཤེགས་པའོ། །
en: To be free of attachment is to be thus-gone.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བ་ནི་རྐྱེན་ལས་བྱུང་བ་སྟེ་བརྗོད་དུ་མེད་པའི་ཆོས་ཉིད་དོ། །
en: Yet, that which is known as dependent origination arises from conditions; this is the inexpressible true nature.

source: ཆོས་ཉིད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའོ། །
en: Since it is the true nature of perfect awakening, it is thus-gone.

source: ཀླུའི་བདག་པོ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་མིག་གིས་ཆོས་མཐོང་བ་སྟེ། ཆོས་མཐོང་བ་ནི་དེ་བཞིན་གཤེགས་པའོ། །
en: Lord of nāgas, that which is known as dependent origination consists in seeing phenomena with the eye of insight, and that experience of phenomena is thus-gone.

source: ཀླུའི་བདག་པོ་ཆོས་ཉིད་དེ་ལྟ་བུ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: Lord of nāgas, bodhisattvas who are devoted to the true nature are known as the heedful.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་བག་ཡོད་པ་ནི་ཉོན་མོངས་པ་རྣམས་ལ་རྒྱུ་བར་མི་བྱེད་པ་དང་། འཕགས་པ་རྣམས་ལ་དད་པར་བྱེད་པ་དང་།
en: “Lord of nāgas, heedful bodhisattvas do not stray into affliction.

source: འཕགས་པ་མ་ཡིན་པ་རྣམས་ཡོངས་སུ་མི་གཏོང་བ་དང་། འཕགས་པའི་རིགས་ཀུན་ཏུ་སྲུང་བར་བྱེད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་སྲུང་བར་བྱེད་པ་དང་། མང་དུ་ཐོས་བརྗེད་པར་མི་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་འདོར་བར་མི་བྱེད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ཤིན་ཏུ་དཀར་བར་བྱེད་པ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་ལས་མི་གཡོ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་ཤིན་ཏུ་གནས་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ལ་རབ་ཏུ་གནས་པའོ། །
en: They have faith in the noble ones; they do not forsake those who are not noble; they protect the lineage of the noble ones; they protect the sacred Dharma; they do not forget their extensive learning; they do not discard the aggregate of discipline; they delight in the aggregate of absorption; they do not waver from the aggregate of insight; they are firmly established in the aggregate of liberation; and they are settled in the aggregate of the of liberating wisdom vision.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་བག་ཡོད་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་ལ་མོས་སོ། །སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཚད་མེད་པ་ཡོངས་སུ་ཚོལ་ལོ། །སངས་རྒྱས་ཀྱི་སྤོབས་པ་ཚད་མེད་པ་ལ་འཇུག་གོ། །སངས་རྒྱས་ཀྱི་སོ་སོ་ཡང་དག་པར་རིག་པ་ཚད་མེད་པ་ལ་འཇུག་གོ། །སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྲུལ་པ་ཚད་མེད་པའི་རྗེས་སུ་འགྲོའོ། །སེམས་ཅན་གྱི་བསམ་པ་ཚད་མེད་པའི་རྗེས་སུ་འཇུག་གོ། །
en: “Lord of nāgas, heedful bodhisattvas are devoted to the immeasurable dharmas of the Buddha.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པར་འགྲོའོ། །དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་མཐོང་ངོ་། །ཆོས་ཚད་མེད་པ་ཉན་ཏོ། །དོན་རྟོགས་པ་ཚད་མེད་པའི་རྗེས་སུ་འགྲོའོ། །སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: They seek the immeasurable wisdom of a buddha, they engage in the immeasurable eloquence of a buddha, they enter the immeasurable correct understandings of a buddha, they emulate the immeasurable emanations of a buddha, they follow the immeasurable thoughts of beings, they travel to countless buddha fields, they see countless thus-gone ones, they hear countless teachings, they pursue countless realizations, they ripen beings in countless realms, and their conduct is immeasurable.

source: སྤྱོད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ། །བག་ཡོད་པ་དེ་ནི་བདག་གི་ཁ་ན་ལས་པ་ཡིན་གྱི་གཞན་གྱི་ཁ་ན་ལས་པ་མ་ཡིན་ནོ། །
en: “Heedful bodhisattvas depend on themselves and not on others.

source: ཀླུའི་བདག་པོ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རང་གི་སེམས་ངེས་པར་སེམས་པ་སྟེ།
en: Because, lord of nāgas, heedful bodhisattvas have ascertained their own minds.

source: དེས་སེམས་ངེས་པར་སེམས་པ་གསུམ་གྱིས་སེམས་ངེས་པར་བསམ་པར་བྱའོ། །
en: The mind is ascertained with three mental ascertainments.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: ཉོན་མོངས་པ་ལ་ངེས་པར་སེམས་པ་དང་། ཡུལ་ལ་ངེས་པར་སེམས་པ་དང་། ཉེ་བར་ལེན་པ་ལ་ངེས་པར་སེམས་པ་སྟེ།
en: They are ascertainment of mind with regard to affliction, ascertainment of mind with regard to objects, and ascertainment of mind with regard to perpetuation.

source: སེམས་ངེས་པར་སེམས་པ་གསུམ་པོ་དེ་དག་གིས་སོ། །
en: These are three ascertainments.

source: གཞན་ཡང་ངེས་པར་སེམས་པ་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན།
en: “There are three further mental ascertainments. What are they?

source: ཞི་གནས་ལ་རྩེ་གཅིག་པ་དང་། ལྷག་མཐོང་ལ་མཁས་པ་དང་།
en: They are one-pointedness in tranquility, skill in special insight, and perseverance in the Dharma.

source: ཆོས་ལ་ནན་ཏན་བྱེད་པ་སྟེ་གསུམ་པོ་དེ་དག་གོ། །གཞན་ཡང་སེམས་ངེས་པར་སེམས་པ་གསུམ་སྟེ།
en: “There are three further mental ascertainments.

source: སེམས་ཞི་བ་དང་། སེམས་དུལ་བ་དང་།
en: They are the peaceful mind, the controlled mind, and the pleasant mind.

source: སེམས་ཡིད་དུ་འོང་བ་སྟེ་གསུམ་པོ་དེ་དག་གོ། །གཞན་ཡང་སེམས་ངེས་པར་སེམས་པ་གསུམ་སྟེ།
en: “There are three further mental ascertainments.

source: དྲང་པོ་དང་། སྒྱུ་མེད་པ་དང་། གཉེར་བ་མེད་པ་སྟེ་གསུམ་པོ་དེ་དག་གོ། །
en: They are honesty, sincerity, and nonacquisitiveness.

source: གཞན་ཡང་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན། ཚུལ་འཆོས་པ་མེད་པ་དང་།
en: “There are three further mental ascertainments.

source: མཉེན་པ་དང་།
en: What are they?

source: འགྲོགས་ན་བདེ་བ་སྟེ་གསུམ་པོ་དེ་དག་གོ། །
en: They are truthfulness, flexibility, and friendliness.

source: གཞན་ཡང་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན།
en: “There are three further. What are they?

source: སྟོང་པ་ཉིད་ལ་ངེས་པར་སེམས་པ་དང་། མཚན་མ་མེད་པ་ལ་ངེས་པར་སེམས་པ་དང་། སྨོན་པ་མེད་པ་ལ་ངེས་པར་སེམས་པ་སྟེ།
en: They are ascertainment with regard to emptiness, ascertainment with regard to signlessness, and ascertainment with regard to wishlessness.

source: སེམས་ངེས་པར་སེམས་པ་གསུམ་པོ་དེ་དག་གོ། །
en: Those are three mental ascertainments.

source: གཞན་ཡང་གསུམ་སྟེ།
en: “There are three further.

source: འདུ་བྱེད་ཐམས་ཅད་ལ་མི་རྟག་པར་སེམས་ངེས་པར་སེམས་ཤིང་། འདུ་བྱེད་ཐམས་ཅད་ལ་སྡུག་བསྔལ་བར་སེམས་ངེས་པར་སེམས་པ་དང་། ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་སེམས་ངེས་པར་སེམས་པ་དང་། མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བར་སེམས་ངེས་པར་སེམས་པ་སྟེ།
en: They are ascertainment with regard to all compounded phenomena being impermanent, ascertainment with regard to all compounded phenomena being suffering, ascertainment with regard to all phenomena being without self, and ascertainment with regard to nirvāṇa being peace.
